// این ماژول به TypeScript اعلام می‌کند که هر فایلی با پسوند .json باید به عنوان یک ماژول معتبر شناخته شود.
// به این ترتیب، می‌توانیم فایل‌های JSON را بدون خطا در پروژه‌های TypeScript ایمپورت کنیم.

declare module "*.json" {
    // متغیری با نام 'value' تعریف می‌کنیم که می‌تواند هر نوع داده‌ای (any) را نگه دارد.
    // دلیل استفاده از 'any' این است که محتوای فایل JSON ممکن است انواع مختلفی داشته باشد
    // مانند آبجکت، آرایه، رشته و غیره. با استفاده از 'any'، از انواع داده‌های مختلف پشتیبانی می‌شود.
    const value: any;
    
    // 'value' به عنوان خروجی ماژول JSON صادر می‌شود. این یعنی وقتی فایل JSON را وارد می‌کنیم،
    // محتوای آن در متغیر 'value' قرار می‌گیرد و می‌توانیم از آن استفاده کنیم.
    export default value;
}
